Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateLandingStringer Property
 Can't create stringer at landing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateLandingStringer { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateLandingStringer As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateLandingStringer {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace